Tutorials/2D/interQHDFoam/damBreak/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

// Note: these are the properties for fuel

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }

    
    thermodynamics
    {
        Hf              0;
        Sf              0;
        Cp              1;
        Cv              1;
    }
    
    transport
    {
        //mu 8e-5;
        mu   1e-3;
        Pr   0.73;
        beta 0.0;
    }
    
    equationOfState
    {
        rho 1;
    }
}

phases (l g);

nul  nul  [0 2 -1 0 0]            1e-05;
rhol rhol [1 -3 0 0 0]            1;
nug  nug  [0 2 -1 0 0]            1e-05;
rhog rhog [1 -3 0 0 0]            0.001;
taul      [0 0 1 0 0] 0.02500e-3; //liquid
taug      [0 0 1 0 0] 0.050e-3; //air
sigma     [1 0 -2 0 0] 0.0;

QGD
{
    implicitDiffusion true;
    QGDCoeffs twoPhaseConstTau;

    twoPhaseConstTauDict
    {
        tau1 0.25e-4; //liquid
        tau2 2.50e-4; //air
    }
}
